/*
 * @author Ioannis Kyriazis 3212018107
 */



/*

ΠΡΟΚΕΙΤΑΙ ΓΙΑ ΕΝΑ ΠΡΟΓΡΑΜΜΑ ΠΟΥ ΕΚΤΟΣ ΑΠΟ ΤΑ ΖΗΤΟΥΜΕΝΑ, ΕΧΩ ΠΡΟΣΘΕΣΕΙ ΠΕΡΙΣΣΟΤΕΡΕΣ ΑΡΜΟΔΙΟΤΗΤΕΣ ΣΤΟΝ ΔΙΑΧΕΙΡΙΣΤΗ ΟΠΩΣ:
-ΚΑΤΑΧΩΡΗΣΗ ΘΕΑΜΑΤΟΣ
-ΔΙΑΓΡΑΦΗ ΘΕΑΜΑΤΟΣ
-ΔΙΑΓΡΑΦΗ ΣΥΓΚΕΚΡΙΜΕΝΟΥ ΧΡΗΣΤΗ ΑΠΟ ΤΟ ΣΥΣΤΗΜΑ
-ΠΡΟΒΟΛΗ ΟΛΩΝ ΤΩΝ ΣΤΟΙΧΕΙΩΝ ΤΩΝ ΧΡΗΣΤΩΝ ΠΟΥ ΕΙΝΑΙ ΕΓΓΕΓΡΑΜΜΕΝΟΙ ΣΤΟ ΣΥΣΤΗΜΑ
-ΠΡΟΒΟΛΗ ΟΛΩΝ ΤΩΝ ΘΕΑΜΑΤΩΝ ΠΟΥ ΕΧΕΙ ΚΑΤΑΧΩΡΗΣΕΙ Ο ΔΙΑΧΕΙΡΙΣΤΗΣ


ΕΠΙΣΗΣ ΕΧΩ ΠΡΟΣΘΕΣΕΙ ΚΑΙ ΣΤΟΝ ΑΠΛΟ ΧΡΗΣΤΗ ΟΡΙΣΜΕΝΕΣ ΛΕΙΤΟΥΡΓΙΕΣ:
-Ο ΚΑΘΕ ΧΡΗΣΤΗΣ ΕΧΕΙ "ΤΗΝ ΛΙΣΤΑ ΤΟΥ" ΜΕ ΑΠΟΤΕΛΕΣΜΑ ΝΑ ΜΠΟΡΕΙ ΝΑ ΔΕΙ ΤΙΣ ΘΕΣΕΙΣ ΠΟΥ ΕΧΕΙ ΚΡΑΤΗΣΕΙ. ΜΕ ΑΥΤΟ ΤΟΝ ΤΡΟΠΟ ΕΧΕΙ ΤΗΝ ΔΥΝΑΤΟΤΗΤΑ ΝΑ ΑΚΥΡΩΣΕΙ ΟΠΟΙΟ ΘΕΑΜΑ ΕΠΙΛΕΞΕΙ ΕΚΕΙΝΟΣ
-ΔΙΑΓΡΑΦΗ ΑΠΟ ΤΟ ΣΥΣΤΗΜΑ ΜΕ ΕΠΙΛΟΓΗ ΤΟΥ ΧΡΗΣΤΗ
-ΕΜΦΑΝΙΣΗ ΟΛΩΝ ΤΩΝ ΘΕΑΜΑΤΩΝ ΠΟΥ ΕΧΕΙ ΚΑΝΕΙ ΚΡΑΤΗΣΗ


ΟΛΑ ΑΥΤΑ ΕΙΧΑΝ ΩΣ ΣΚΟΠΟ ΤΗΝ ΔΗΜΙΟΥΡΓΙΑ ΕΝΟΣ ΠΡΟΓΡΑΜΜΑΤΟΣ ΠΟΥ ΜΠΟΡΕΙ ΝΑ ΧΡΗΣΙΜΟΠΟΙΗΘΕΙ ΑΠΟ ΠΟΛΛΑΠΛΟΥΣ ΧΡΗΣΤΕΣ. ΕΠΙΣΗΣ ΣΤΟΧΕΥΕΙ ΚΑΙ ΣΤΗΝ ΕΥΚΟΛΙΑ ΤΩΝ ΚΙΝΗΣΕΩΝ ΕΝΟΣ ΑΠΛΟΥ ΧΡΗΣΤΗ ΕΝΤΟΣ ΤΟΥ ΠΡΟΓΡΑΜΜΑΤΟΣ
ΚΑΘΩΣ ΔΙΝΕΤΑΙ Η ΕΛΕΥΘΕΡΙΑ ΝΑ ΚΑΝΕΙ ΠΕΙΡΑΜΑΤΑ ΠΑΝΩ ΣΤΑ ΘΕΑΜΑΤΑ ΚΑΙ ΤΟΝ ΛΟΓΑΡΙΑΣΜΟ ΤΟΥ

*/

public class Main {

    public static void main(String[] args)
    {
        Menu m=new Menu(); //ΔΗΜΙΟΥΡΓΙΑ ΑΝΤΙΚΕΙΜΕΝΟΥ ΓΙΑ ΤΟ ΜΕΝΟΥ
        m.menug(); //ΞΕΝΙΚΙΝΗΜΑ ΤΟΥ ΠΡΟΓΡΑΜΜΑΤΟΣ ΜΕ ΤΟ ΓΕΝΙΚΟ ΜΕΝΟΥ
        System.exit(0); //ΤΕΛΟΣ ΤΟΥ ΠΡΟΓΡΑΜΜΑΤΟΣ
    }
    
    
}
